
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/nyshk97/aws-ecs-terraform/actions/runs/6258869958)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-083229c009d2de319]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07300af33a9c001a8]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07a38580cf08b9976]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b6e7990e665c661f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-01db1c87703bd6a1d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e2ae3c2ef6c9deac]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0d03142caa758fc29]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0807f0dec95bec02b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ded2aaadc5bb0224]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09f326f6a06eef180]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0581be1e8fb9f4a87]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cb8be38df8114563]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b13f439843b02a26]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0f509b7de90ca1df0]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0734164d7a254ad13]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a9c4fbae37afe4e5]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09141fa82cbb4af19]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0183803c6e9b85e9b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cb8be38df81145631080289494]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-01d5f76fbea4c8cac]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-039e20af860695e54]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ded2aaadc5bb02241080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0d03142caa758fc291080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-083229c009d2de319"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-083229c009d2de319"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.alb: Creating...
aws_security_group.ecs: Creating...
aws_security_group.ecs: Creation complete after 4s [id=sg-0d988622b7767ecfd]
aws_security_group.alb: Creation complete after 4s [id=sg-03345e2bb275c36d0]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-3223306409]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"865cc2e91be2c8d52594006c5143b5aedbb80b31","Vars":{},"WorkflowName":"Terraform"} -->